<a href="https://colab.research.google.com/github/yooste/SOLUX_summer_data/blob/master/2%EC%A3%BC%EC%B0%A8/pandas_chap07_0729.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [3]:
friend_dict_list = [{'name': 'Jone', 'age':15, 'job': 'student'},
                    {'name': 'Jenny', 'age':30, 'job': 'developer'},
                    {'name': 'Nate', 'age':30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job']) # friend_dict_list를 이용하여 데이터프레임 생성

In [4]:
df.head()

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Nate   30    teacher

In [5]:
df['salary'] = 0  # 0을 갖는 'salary'열 삽입

In [6]:
df.head()

    name  age        job  salary
0   Jone   15    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

In [7]:
import numpy as np

In [8]:
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no')  # 직업이 student이면 연봉이 없고,
                                                              # student가 아니면 연봉이 있다.

In [9]:
df.head()

    name  age        job salary
0   Jone   15    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [10]:
# 중간고사와 기말고사 점수를 포함하는 friend_dict_list
friend_dict_list = [{'name': 'Jone', 'midterm':95, 'final': 85},
                    {'name': 'Jenny', 'midterm':85, 'final': 80},
                    {'name': 'Nate', 'midterm':30, 'final': 10}]
# friend_dict_list를 가지고 데이터프레임 생성
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])

In [11]:
df.head()

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10

In [12]:
df['total'] = df['midterm'] + df['final']   # total은 중간고사 점수와 기말고사 점수를 더한 총점을 갖는다.

In [13]:
df.head()

    name  midterm  final  total
0   Jone       95     85    180
1  Jenny       85     80    165
2   Nate       30     10     40

In [14]:
df['average'] = df['total']/2   # total 점수를 2로 나누어 평균 값 구하기

In [15]:
df.head()

    name  midterm  final  total  average
0   Jone       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       30     10     40     20.0

In [17]:
grades = []   # 성적을 저장할 리스트 생성

for row in df['average']:   # df['average']에서 한 행씩 받아온다.
  if row >= 90:   # 90점 이상일 경우 A
    grades.append('A')
  elif row >= 80:   # 80점 이상일 경우 B
    grades.append('B')
  else:   # 그외의 점수는 F로 준다.
    grades.append('F')

df['grade'] = grades    # grade열에 성적 정보를 넣어준다.

In [18]:
df.head()

    name  midterm  final  total  average grade
0   Jone       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       30     10     40     20.0     F

In [19]:
def pass_or_fail(row):    # F등급은 Fail을 그 외의 등급은 Pass를 받는 함수 pass_or_fail
  if row != 'F':
    return "Pass"
  else:
    return "Fail"

In [20]:
df.grade = df.grade.apply(pass_or_fail)   # 성적칸에 pass_or_fail 함수를 적용하여 성적을 결정한다.(apply사용)

In [21]:
df.head()

    name  midterm  final  total  average grade
0   Jone       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       30     10     40     20.0  Fail

In [22]:
date_list = [
             {
                 'yyyy-mm-dd' : '2000-06-27'
             },
             {
                 'yyyy-mm-dd' : '2007-10-27'
             }
]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
# 2개의 날짜 정보를 가지고 데이터프레임 생성

In [23]:
df.head()

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27

In [24]:
# 연도 추출 함수 정의
def extract_year(row):  
  return row.split('-')[0]    # '-'를 구분기호로 하여 split()한 후에 첫번째 인자를 반환한다. -> 연도 추출

In [25]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)   
# 'year'칸에 extract_year 함수를 이용해 추출한 연도 정보를 저장한다.

In [26]:
df.head()

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007

In [27]:
# 중간고사와 기말고사 점수를 포함하는 friend_dict_list
friend_dict_list = [{'name': 'Jone', 'midterm':95, 'final': 85},
                    {'name': 'Jenny', 'midterm':85, 'final': 80},
                    {'name': 'Nate', 'midterm':30, 'final': 10}]
# friend_dict_list를 가지고 데이터프레임 생성
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])

In [28]:
df.head()

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10

In [32]:
df2 = pd.DataFrame([
                    ['Ben', 50, 50]],
                   columns = ['name','midterm','final']
) # 'Ben'의 정보를 가진 데이터프레임 df2 생성

In [33]:
df2.head()

  name  midterm  final
0  Ben       50     50

In [34]:
df.append(df2, ignore_index=True)   # 원본 데이터프레임인 df에 append()를 이용하여 df2를 붙인다.
  # 이 때 ignore_index = True를 사용하여 df2의 인덱스를 무시한다.

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10
3    Ben       50     50